Revit 2027 API
Category.SubCategories Property
Returns a map containing all of the subcategories of this category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CategoryNameMap SubCategories { get; }
Public ReadOnly Property SubCategories As CategoryNameMap
	Get
public:
property CategoryNameMap^ SubCategories {
	CategoryNameMap^ get ();
}
member SubCategories : CategoryNameMap with get
Return Value
CategoryNameMap
An empty map if the category has no subcategories.
See Also
Reference
Category Class
Autodesk.Revit.DB Namespace